CREATE DATABASE  IF NOT EXISTS `spark` /*!40100 DEFAULT CHARACTER SET latin1 */;
USE `spark`;
-- MySQL dump 10.13  Distrib 8.0.16, for Win64 (x86_64)
--
-- Host: localhost    Database: spark
-- ------------------------------------------------------
-- Server version	5.7.26-log

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
 SET NAMES utf8 ;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `result`
--

DROP TABLE IF EXISTS `result`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `result` (
  `keyword` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT NULL,
  `search_count` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `result`
--

LOCK TABLES `result` WRITE;
/*!40000 ALTER TABLE `result` DISABLE KEYS */;
INSERT INTO `result` VALUES ('文案编辑',249),('大数据工程师',673),('UI设计师',79),('测试工程师',401),('产品设计',630),('新媒体运营',772),('交互设计',82),('文案编辑',249),('大数据工程师',673),('测试工程师',401),('UI设计师',79),('新媒体运营',772),('产品设计',630),('交互设计',82),('大数据工程师',673),('文案编辑',249),('UI设计师',79),('测试工程师',401),('产品设计',630),('新媒体运营',772),('交互设计',82),('大数据工程师',673),('UI设计师',79),('产品设计',630),('交互设计',82),('文案编辑',249),('测试工程师',401),('新媒体运营',772),('大数据工程师',673),('UI设计师',79),('文案编辑',249),('产品设计',630),('测试工程师',401),('交互设计',82),('新媒体运营',772),('大数据工程师',673),('UI设计师',79),('生产经理',310),('产品设计',630),('售前工程师',461),('网页设计',104),('信用卡业务',102),('交互设计',82),('精算师',29),('文案编辑',249),('银行柜员',103),('前端工程师',314),('运维工程师',437),('证券经纪人',194),('游戏开发',210),('通用岗位',881),('移动开发',455),('信托业务',22),('测试工程师',820),('新媒体运营',772),('售后工程师',236),('银行客户经理',55),('数据分析师',100),('人工智能',505),('大数据工程师',673),('文案编辑',249),('UI设计师',79),('银行柜员',103),('生产经理',310),('前端工程师',314),('产品设计',630),('运维工程师',437),('售前工程师',461),('网页设计',104),('证券经纪人',194),('信用卡业务',102),('游戏开发',210),('交互设计',82),('通用岗位',881),('精算师',29),('移动开发',455),('信托业务',22),('测试工程师',820),('新媒体运营',772),('售后工程师',236),('银行客户经理',55),('数据分析师',100),('人工智能',505),('大数据工程师',673),('文案编辑',249),('UI设计师',79),('银行柜员',103),('生产经理',310),('前端工程师',314),('产品设计',630),('运维工程师',437),('售前工程师',461),('证券经纪人',194),('网页设计',104),('游戏开发',210),('信用卡业务',102),('通用岗位',881),('交互设计',82),('移动开发',455),('精算师',29),('信托业务',22),('测试工程师',820),('新媒体运营',772),('售后工程师',236),('银行客户经理',55),('数据分析师',100),('人工智能',505);
/*!40000 ALTER TABLE `result` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `searchkeyword`
--

DROP TABLE IF EXISTS `searchkeyword`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `searchkeyword` (
  `insert_time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `keyword` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci DEFAULT NULL,
  `search_count` int(11) DEFAULT NULL,
  `insertIndex` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `searchkeyword`
--

LOCK TABLES `searchkeyword` WRITE;
/*!40000 ALTER TABLE `searchkeyword` DISABLE KEYS */;
INSERT INTO `searchkeyword` VALUES ('2019-10-11 06:01:41','大数据工程师',673,2),('2019-10-11 06:01:41','文案编辑',249,2),('2019-10-11 06:01:41','UI设计师',79,2),('2019-10-11 06:01:41','测试工程师',401,2),('2019-10-11 06:01:41','产品设计',630,2),('2019-10-11 06:01:41','新媒体运营',772,2),('2019-10-11 06:01:41','交互设计',82,2),('2019-10-11 06:01:44','文案编辑',249,3),('2019-10-11 06:01:44','大数据工程师',673,3),('2019-10-11 06:01:44','测试工程师',401,3),('2019-10-11 06:01:44','UI设计师',79,3),('2019-10-11 06:01:44','新媒体运营',772,3),('2019-10-11 06:01:44','产品设计',630,3),('2019-10-11 06:01:44','交互设计',82,3),('2019-10-11 06:01:49','大数据工程师',673,4),('2019-10-11 06:01:49','文案编辑',249,4),('2019-10-11 06:01:49','UI设计师',79,4),('2019-10-11 06:01:49','银行柜员',103,4),('2019-10-11 06:01:49','生产经理',310,4),('2019-10-11 06:01:49','前端工程师',314,4),('2019-10-11 06:01:49','产品设计',630,4),('2019-10-11 06:01:49','运维工程师',437,4),('2019-10-11 06:01:49','售前工程师',461,4),('2019-10-11 06:01:49','证券经纪人',194,4),('2019-10-11 06:01:49','网页设计',104,4),('2019-10-11 06:01:49','游戏开发',210,4),('2019-10-11 06:01:49','信用卡业务',102,4),('2019-10-11 06:01:49','通用岗位',881,4),('2019-10-11 06:01:49','交互设计',82,4),('2019-10-11 06:01:49','移动开发',455,4),('2019-10-11 06:01:49','精算师',29,4),('2019-10-11 06:01:49','信托业务',22,4),('2019-10-11 06:01:49','测试工程师',820,4),('2019-10-11 06:01:49','新媒体运营',772,4),('2019-10-11 06:01:49','售后工程师',236,4),('2019-10-11 06:01:49','银行客户经理',55,4),('2019-10-11 06:01:49','数据分析师',100,4),('2019-10-11 06:01:49','人工智能',505,4),('2019-10-11 06:01:52','大数据工程师',673,4),('2019-10-11 06:01:52','文案编辑',249,4),('2019-10-11 06:01:52','UI设计师',79,4),('2019-10-11 06:01:52','银行柜员',103,4),('2019-10-11 06:01:52','生产经理',310,4),('2019-10-11 06:01:52','前端工程师',314,4),('2019-10-11 06:01:52','产品设计',630,4),('2019-10-11 06:01:52','运维工程师',437,4),('2019-10-11 06:01:52','售前工程师',461,4),('2019-10-11 06:01:52','证券经纪人',194,4),('2019-10-11 06:01:52','游戏开发',210,4),('2019-10-11 06:01:52','网页设计',104,4),('2019-10-11 06:01:52','通用岗位',881,4),('2019-10-11 06:01:52','信用卡业务',102,4),('2019-10-11 06:01:52','移动开发',455,4),('2019-10-11 06:01:52','交互设计',82,4),('2019-10-11 06:01:52','信托业务',22,4),('2019-10-11 06:01:52','精算师',29,4),('2019-10-11 06:01:52','测试工程师',820,4),('2019-10-11 06:01:52','新媒体运营',772,4),('2019-10-11 06:01:52','售后工程师',236,4),('2019-10-11 06:01:52','银行客户经理',55,4),('2019-10-11 06:01:52','数据分析师',100,4),('2019-10-11 06:01:52','人工智能',505,4),('2019-10-11 06:01:57','文案编辑',249,5),('2019-10-11 06:01:57','市政工程师',30,5),('2019-10-11 06:01:57','自动化工程师',176,5),('2019-10-11 06:01:57','大数据工程师',673,5),('2019-10-11 06:01:57','景观设计',151,5),('2019-10-11 06:01:57','UI设计师',79,5),('2019-10-11 06:01:57','银行柜员',103,5),('2019-10-11 06:01:57','生产经理',527,5),('2019-10-11 06:01:57','前端工程师',314,5),('2019-10-11 06:01:57','产品设计',630,5),('2019-10-11 06:01:57','运维工程师',437,5),('2019-10-11 06:01:57','纺织工程师',8,5),('2019-10-11 06:01:57','证券经纪人',194,5),('2019-10-11 06:01:57','售前工程师',461,5),('2019-10-11 06:01:57','机械工程师',585,5),('2019-10-11 06:01:57','网页设计',104,5),('2019-10-11 06:01:57','游戏开发',210,5),('2019-10-11 06:01:57','信用卡业务',102,5),('2019-10-11 06:01:57','通用岗位',881,5),('2019-10-11 06:01:57','建筑工程师',172,5),('2019-10-11 06:01:57','移动开发',455,5),('2019-10-11 06:01:57','土建工程师',93,5),('2019-10-11 06:01:57','信托业务',22,5),('2019-10-11 06:01:57','机电工程师',75,5),('2019-10-11 06:01:57','环保工程师',314,5),('2019-10-11 06:01:57','服装设计',85,5),('2019-10-11 06:01:57','测试工程师',820,5),('2019-10-11 06:01:57','给排水工程师',24,5),('2019-10-11 06:01:57','医药技术研发',190,5),('2019-10-11 06:01:57','交互设计',82,5),('2019-10-11 06:01:57','新媒体运营',772,5),('2019-10-11 06:01:57','电气工程师',599,5),('2019-10-11 06:01:57','售后工程师',236,5),('2019-10-11 06:01:57','销售业务跟单',614,5),('2019-10-11 06:01:57','暖通工程师',103,5),('2019-10-11 06:01:57','造价工程师',124,5),('2019-10-11 06:01:57','建筑设计师',228,5),('2019-10-11 06:01:57','生物制药',244,5),('2019-10-11 06:01:57','银行客户经理',55,5),('2019-10-11 06:01:57','理赔专员',52,5),('2019-10-11 06:01:57','维修工程师',25,5),('2019-10-11 06:01:57','实验室技术员',53,5),('2019-10-11 06:01:57','汽车制造',159,5),('2019-10-11 06:01:57','装潢设计师',117,5),('2019-10-11 06:01:57','汽车设计',394,5),('2019-10-11 06:01:57','制冷工程师',12,5),('2019-10-11 06:01:57','kw',2,5),('2019-10-11 06:01:57','精算师',29,5),('2019-10-11 06:01:57','数据分析师',100,5),('2019-10-11 06:01:57','模具工程师',302,5),('2019-10-11 06:01:57','地质工程师',35,5),('2019-10-11 06:01:57','汽车维修、保养',26,5),('2019-10-11 06:01:57','人工智能',505,5),('2019-10-11 06:02:00','文案编辑',249,6),('2019-10-11 06:02:00','市政工程师',30,6),('2019-10-11 06:02:00','自动化工程师',176,6),('2019-10-11 06:02:00','大数据工程师',673,6),('2019-10-11 06:02:00','景观设计',151,6),('2019-10-11 06:02:00','UI设计师',79,6),('2019-10-11 06:02:00','银行柜员',103,6),('2019-10-11 06:02:00','生产经理',527,6),('2019-10-11 06:02:00','前端工程师',314,6),('2019-10-11 06:02:00','产品设计',630,6),('2019-10-11 06:02:00','运维工程师',437,6),('2019-10-11 06:02:00','纺织工程师',8,6),('2019-10-11 06:02:00','证券经纪人',194,6),('2019-10-11 06:02:00','售前工程师',461,6),('2019-10-11 06:02:00','机械工程师',585,6),('2019-10-11 06:02:00','网页设计',104,6),('2019-10-11 06:02:00','游戏开发',210,6),('2019-10-11 06:02:00','信用卡业务',102,6),('2019-10-11 06:02:00','通用岗位',881,6),('2019-10-11 06:02:00','建筑工程师',172,6),('2019-10-11 06:02:00','移动开发',455,6),('2019-10-11 06:02:00','土建工程师',93,6),('2019-10-11 06:02:00','信托业务',22,6),('2019-10-11 06:02:00','机电工程师',75,6),('2019-10-11 06:02:00','环保工程师',314,6),('2019-10-11 06:02:00','服装设计',85,6),('2019-10-11 06:02:00','测试工程师',820,6),('2019-10-11 06:02:00','给排水工程师',24,6),('2019-10-11 06:02:00','医药技术研发',190,6),('2019-10-11 06:02:00','交互设计',82,6),('2019-10-11 06:02:00','新媒体运营',772,6),('2019-10-11 06:02:00','电气工程师',599,6),('2019-10-11 06:02:00','售后工程师',236,6),('2019-10-11 06:02:00','销售业务跟单',614,6),('2019-10-11 06:02:00','暖通工程师',103,6),('2019-10-11 06:02:00','造价工程师',124,6),('2019-10-11 06:02:00','建筑设计师',228,6),('2019-10-11 06:02:00','生物制药',244,6),('2019-10-11 06:02:00','银行客户经理',55,6),('2019-10-11 06:02:00','理赔专员',52,6),('2019-10-11 06:02:00','维修工程师',25,6),('2019-10-11 06:02:00','实验室技术员',53,6),('2019-10-11 06:02:00','汽车制造',159,6),('2019-10-11 06:02:00','装潢设计师',117,6),('2019-10-11 06:02:00','制冷工程师',12,6),('2019-10-11 06:02:00','汽车设计',394,6),('2019-10-11 06:02:00','精算师',29,6),('2019-10-11 06:02:00','kw',2,6),('2019-10-11 06:02:00','数据分析师',100,6),('2019-10-11 06:02:00','模具工程师',302,6),('2019-10-11 06:02:00','地质工程师',35,6),('2019-10-11 06:02:00','汽车维修、保养',26,6),('2019-10-11 06:02:00','人工智能',505,6),('2019-10-11 06:15:27','你好',50,5);
/*!40000 ALTER TABLE `searchkeyword` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `streaming_itemcount`
--

DROP TABLE IF EXISTS `streaming_itemcount`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `streaming_itemcount` (
  `keyword` varchar(30) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `streaming_itemcount`
--

LOCK TABLES `streaming_itemcount` WRITE;
/*!40000 ALTER TABLE `streaming_itemcount` DISABLE KEYS */;
/*!40000 ALTER TABLE `streaming_itemcount` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `workresult`
--

DROP TABLE IF EXISTS `workresult`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `workresult` (
  `insert_time` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `keyword` varchar(255) DEFAULT NULL,
  `search_count` int(11) DEFAULT NULL,
  `insertIndex` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `workresult`
--

LOCK TABLES `workresult` WRITE;
/*!40000 ALTER TABLE `workresult` DISABLE KEYS */;
/*!40000 ALTER TABLE `workresult` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2019-10-11 14:58:23
